tutorials/overset/flowTests/staticCylinderSheddingTest/bodyFittedCylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
//         solver           BiCGStab;
//         preconditioner   DILU;

        solver           CG;
        preconditioner   DIC;

        maxIter          1000;
        tolerance        1e-7;
        relTol           0;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        tolerance        1e-06;
        relTol           0;
        maxIter          200;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// Potential flow solution
SIMPLE
{
    nNonOrthogonalCorrectors 1;
    pRefCell 0;
    pRefValue 0;
}

// ************************************************************************* //
