tutorials/overset/flowTests/staticCylinderSheddingTest/bodyFittedCylinder/system/tetFemSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          tetFemSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    motionU
    {
        solver          amgSolver;
        cycle           W-cycle;
        policy          AAMG;
        nPreSweeps      2;
        nPostSweeps     2;
        groupSize       4;
        minCoarseEqns   30;
        nMaxLevels      100;
        scale           on;
        smoother        ILU;

        minIter         0;
        maxIter         500;
        tolerance       1e-8;
        relTol          0.001;
    };
}


// ************************************************************************* //
